[
    {
      "rating": 5,
      "numReviews": 12,
      "price": 28980,
      "countInStock": 11,
      "_id": "679626ba02e8be260471b93a",
      "name": "Sony Playstation 4 Pro White Version",
      "image": "/images/playstation.jpg",
      "description": "The ultimate home entertainment center starts with PlayStation. Whether you are into gaming, HD movies, television, music",
      "brand": "Sony",
      "category": "Electronics",
      "user": "679626ba02e8be260471b934",
      "reviews": [],
      "__v": 0,
      "createdAt": "2025-01-26T12:12:42.997Z",
      "updatedAt": "2025-01-26T12:12:42.997Z"
    },
    {
      "rating": 3,
      "numReviews": 12,
      "price": 35690,
      "countInStock": 5,
      "_id": "679626ba02e8be260471b939",
      "name": "Cannon EOS 80D DSLR Camera",
      "image": "/images/camera.jpg",
      "description": "Characterized by versatile imaging specs, the Canon EOS 80D further clarifies itself using a pair of robust focusing systems and an intuitive design",
      "brand": "Cannon",
      "category": "Electronics",
      "user": "679626ba02e8be260471b934",
      "reviews": [],
      "__v": 0,
      "createdAt": "2025-01-26T12:12:42.997Z",
      "updatedAt": "2025-01-26T12:12:42.997Z"
    },
    {
      "rating": 4.5,
      "numReviews": 12,
      "price": 12764,
      "countInStock": 10,
      "_id": "679626ba02e8be260471b937",
      "name": "Airpods Wireless Bluetooth Headphones",
      "image": "/images/airpods.jpg",
      "description": "Bluetooth technology lets you connect it with compatible devices wirelessly High-quality AAC audio offers immersive listening experience Built-in microphone allows you to take calls while working",
      "brand": "Apple",
      "category": "Electronics",
      "user": "679626ba02e8be260471b934",
      "reviews": [],
      "__v": 0,
      "createdAt": "2025-01-26T12:12:42.997Z",
      "updatedAt": "2025-01-26T12:12:42.997Z"
    },
    {
      "rating": 4,
      "numReviews": 8,
      "price": 87900,
      "countInStock": 7,
      "_id": "679626ba02e8be260471b938",
      "name": "iPhone 11 Pro 256GB Memory",
      "image": "/images/phone.jpg",
      "description": "Introducing the iPhone 11 Pro. A transformative triple-camera system that adds tons of capability without complexity. An unprecedented leap in battery life",
      "brand": "Apple",
      "category": "Electronics",
      "user": "679626ba02e8be260471b934",
      "reviews": [],
      "__v": 0,
      "createdAt": "2025-01-26T12:12:42.997Z",
      "updatedAt": "2025-01-26T12:12:42.997Z"
    },
    {
      "rating": 4,
      "numReviews": 12,
      "price": 2599,
      "countInStock": 0,
      "_id": "679626ba02e8be260471b93c",
      "name": "Amazon Echo Dot 3rd Generation",
      "image": "/images/alexa.jpg",
      "description": "Meet Echo Dot - Our most popular smart speaker with a fabric design. It is our most compact smart speaker that fits perfectly into small space",
      "brand": "Amazon",
      "category": "Electronics",
      "user": "679626ba02e8be260471b934",
      "reviews": [],
      "__v": 0,
      "createdAt": "2025-01-26T12:12:42.998Z",
      "updatedAt": "2025-01-26T12:12:42.998Z"
    },
    {
      "rating": 3.5,
      "numReviews": 10,
      "price": 2395,
      "countInStock": 7,
      "_id": "679626ba02e8be260471b93b",
      "name": "Logitech G-Series Gaming Mouse",
      "image": "/images/mouse.jpg",
      "description": "Get a better handle on your games with this Logitech LIGHTSYNC gaming mouse. The six programmable buttons allow customization for a smooth playing experience",
      "brand": "Logitech",
      "category": "Electronics",
      "user": "679626ba02e8be260471b934",
      "reviews": [],
      "__v": 0,
      "createdAt": "2025-01-26T12:12:42.998Z",
      "updatedAt": "2025-01-26T12:12:42.998Z"
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 8599,
      "countInStock": 9,
      "_id": "6796275154aba43c987ae3c0",
      "name": "Samsung 27-inch (68.59cm) FHD, IPS, 100 Hz, 1920 x 1080 Flat Monitor",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/612Ax0sjR8L._SX522_.jpg",
      "brand": "Samsung ",
      "category": "Electronics",
      "description": "27 Inch Samsung Flat IPS Display Monitor - FHD 1,920 x 1,080 Resolution Aspect Ratio: 16:9 | 178° Horizontal and Vertical Viewing Angle | Refresh Rate - 100 Hz | Color Support - Max 16.7M | Brightness (Typical) - 250 cd/㎡ | Response Time (ms) - 4(GTG) IPS Panel | Wide Viewing Angle | 100Hz Refresh Rate | AMD FreeSync | Game Mode | Eye Saver Mode & Less Screen Flickering | Versatile connectivity with HDMI & Display Port Additional Features: 1000:1(Typ.) Contrast Ratio (Static) | Color Gamut (sRGB Coverage) 95% | Auto Source Switch | Tilt -2.0°(±2.0°)~22.0°(±2.0°) | Wall Mount Compatible Connectivity Options: Display Port, Display Port Version 1.2, HDCP Version (DP) 1.2, HDMI Port, HDMI Version 1.4, HDCP Version (HDMI) 1.4 || 3-Year Warranty From Manufacturer",
      "reviews": [],
      "createdAt": "2025-01-26T12:15:13.229Z",
      "updatedAt": "2025-01-26T12:16:02.303Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 137900,
      "countInStock": 10,
      "_id": "679629e454aba43c987ae3c1",
      "name": "iPhone 16 Pro Max 256 GB: 5G Mobile Phone",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/619oqSJVY5L._SX679_.jpg",
      "brand": "Apple",
      "category": "Electronics",
      "description": "STUNNING TITANIUM DESIGN — iPhone 16 Pro Max has a strong and light titanium design with a larger 17.43 cm (6.9″) Super Retina XDR display. It’s remarkably durable with the latest-generation Ceramic Shield material that’s 2x tougher than any smartphone glass. BUILT FOR APPLE INTELLIGENCE — Apple Intelligence is the personal intelligence system that helps you write, express yourself and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data — not even Apple. TAKE TOTAL CAMERA CONTROL — Camera Control gives you an easier way to quickly access camera tools, like zoom or depth of field, so you can take the perfect shot in record time. MAGNIFICENT SHOTS— Take your videos to a whole new level with 4K 120 fps Dolby Vision, enabled by the 48MP Fusion camera. The improved 48MP Ultra Wide camera lets you capture mesmerising detail in macro photos and wide-angle shots. PHOTOGRAPHIC STYLES — The latest-generation Photographic Styles give you greater creative flexibility, so you can make every photo even more you. And thanks to advances in the image pipeline, you can now reverse any style, any time.",
      "reviews": [],
      "createdAt": "2025-01-26T12:26:12.974Z",
      "updatedAt": "2025-01-26T12:27:20.462Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 74900,
      "countInStock": 12,
      "_id": "67962a4e54aba43c987ae3c2",
      "name": "iPhone 16 128 GB: 5G Mobile Phone with Camera Control",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/713SsA7gftL._SX679_.jpg",
      "brand": "Apple",
      "category": "Electronics",
      "description": "BUILT FOR APPLE INTELLIGENCE — Apple Intelligence is the personal intelligence system that helps you write, express yourself and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data — not even Apple. TAKE TOTAL CAMERA CONTROL — Camera Control gives you an easier way to quickly access camera tools, like zoom or depth of field, so you can take the perfect shot in record time. GET FURTHER AND CLOSER — The improved Ultra Wide camera with autofocus lets you take incredibly detailed macro photos and videos. Use the 48MP Fusion camera for stunning high-resolution images, and zoom in with the 2x optical-quality Telephoto. PHOTOGRAPHIC STYLES — The latest-generation Photographic Styles give you greater creative flexibility, so you can make every photo even more you. And you can reverse any of those styles anytime you want. SUPER-SMART A18 CHIP — A18 jumps two generations ahead of the A16 Bionic chip in iPhone 15. It enables Apple Intelligence, powers advanced photo and video features, and supports console-level gaming, with exceptional power efficiency.",
      "reviews": [],
      "createdAt": "2025-01-26T12:27:58.060Z",
      "updatedAt": "2025-01-26T12:28:37.153Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 51990,
      "countInStock": 12,
      "_id": "67962ac554aba43c987ae3c3",
      "name": "ASUS Vivobook 16\" FHD+ (1920 X 1200), 60Hz 300Nits, Core i5-12500H",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/61fsBFww9DL._SX522_.jpg",
      "brand": "Asus",
      "category": "Electronics",
      "description": "Processor : Intel Core i5-12500H Processor 2.5 GHz (18M Cache, up to 4.5 GHz, 4P+8E cores) Perfect for multitasking and entertainment Memory : 16GB DDR4 RAM| Storage : 512GB M.2 NVMe PCIe 4.0 SSD Graphics : Intergrated Intel Iris Xᵉ Graphics Display :16.0-inch, WUXGA (1920 x 1200) 16:10 aspect ratio, 60Hz refresh rate, 300nits Brightness| Keyboard : Backlit Chiclet Keyboard Battery : 42WHrs, 3S1P, 3-cell Li-ion I/O Ports : 1x USB 2.0 Type-A, 1x USB 3.2 Gen 1 Type-C, 2x USB 3.2 Gen 1 Type-A, 1x HDMI 1.4, 1x DC-in Audio : 1x 3.5mm Combo Audio Jack, Webcam : 720p HD camera with privacy shutter, Mic : Built-in array microphone On Board Wireless : Wi-Fi 5(802.11ac) (Dual band) 1*1 + Bluetooth 5.1 Wireless Card (*Bluetooth version may change with OS version different.)",
      "reviews": [],
      "createdAt": "2025-01-26T12:29:57.049Z",
      "updatedAt": "2025-01-26T12:30:34.432Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 89900,
      "countInStock": 12,
      "_id": "67962b1d54aba43c987ae3c4",
      "name": "Apple Watch Ultra 2 [GPS + Cellular 49 mm] Smartwatch",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/717pONN0kUL._SX679_.jpg",
      "brand": "Apple",
      "category": "Electronics",
      "description": "WHY APPLE WATCH ULTRA 2 — Meet the ultimate sports and adventure watch. Advanced features for runners, cyclists, swimmers, hikers, divers and more. Rugged titanium case, now available in satin black. Super-bright Always-On Retina display. Incredibly accurate precision dual-frequency GPS. Powerful health, safety and connectivity features. And up to 36 hours of battery life for normal use and 72 hours in Low Power Mode. EXTREMELY RUGGED, INCREDIBLY CAPABLE — 49 mm corrosion-resistant titanium case. Sapphire front crystal. Large Digital Crown and customisable Action button for instant control over a variety of functions. Tested to MIL-STD 810H. Water resistance 100 m. THE FREEDOM OF CELLULAR — With a cellular service plan, you can call and text without your iPhone nearby. Stream your favourite music and podcasts. Get directions with Maps. MAXIMISE YOUR TRAINING — Advanced metrics, views and experiences in the Workout app, including Heart Rate Zones, custom workouts and training load, which can provide insights into the impact your workouts have on your body over time. FOR RUNNERS — Precision dual-frequency GPS for incredible accuracy. Automatic track detection. Advanced running form metrics to help understand how efficiently you run. Customisable workouts that can include warmups, recovery intervals and time to cool down.",
      "reviews": [],
      "createdAt": "2025-01-26T12:31:25.598Z",
      "updatedAt": "2025-01-26T12:32:08.884Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 22990,
      "countInStock": 12,
      "_id": "67962db461e9dd53046b2c81",
      "name": "Apple AirPods Pro (2nd Generation) with MagSafe Case",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/61sRKTAfrhL._SX679_.jpg",
      "brand": "Apple",
      "category": "Electronics",
      "description": "The speakers inside the EarPods have been engineered to maximise sound output, which means you get high-quality audio. The EarPods (USB-C) also include a built-in remote that lets you adjust the volume, control the playback of music and video, and answer or end calls with a press of the remote. Designed by Apple Deeper, richer bass tones Greater protection from sweat and water",
      "reviews": [],
      "createdAt": "2025-01-26T12:42:28.376Z",
      "updatedAt": "2025-01-26T12:43:00.851Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 1249,
      "countInStock": 134,
      "_id": "67962dd861e9dd53046b2c82",
      "name": "Cosmic Byte ARES Wired Controller for PC",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/51gHWwp0c3L._SX679_.jpg",
      "brand": "Cosmic Byte",
      "category": "Electronics",
      "description": "Ergonomic Design and Rubbersied Textured Sticks for enhanced Grip Pressure Sensitive Analog Triggers and LED Backlit Buttons. Supports Xinput and D Input Vibration Feature and Zero Lag connection using USB cable Turbo and Auto Turbo Buttons for on the fly customizations 1.8 meter USB cable so comfortablly sit on the couch to game",
      "reviews": [],
      "createdAt": "2025-01-26T12:43:04.105Z",
      "updatedAt": "2025-01-26T12:44:26.805Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 1049,
      "countInStock": 34,
      "_id": "67962e8261e9dd53046b2c83",
      "name": "Ant Esports KM500W Gaming Backlit Keyboard and Mouse Combo",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/61B3tl7HEBL._SX522_.jpg",
      "brand": "Ant Esports",
      "category": "Electronics",
      "description": "Rainbow LED Backlit for Fantastic Game Enjoyment – Ant Esports KM500W, 2020 New version rainbow backlit gaming keyboard and mouse combo with multiple colours brings you to the fantastic gaming world. Independent Crater Structure for Longer Service Life -The key life of Ant Esports gaming keyboard can reach 50 million, which is twice of the normal wired computer keyboard, ensuring the durability. Adjustable DPI & Programmable PC Gaming Mouse - Advanced Gaming Optical Sensor, 4 Adjustable DPI - 800/1600/2400/3200 dpi meet your different needs. Wide Compatibility - The keyboard is slip-resistant designed to avoid accident water, coffee splashing, extending service life. This Combo is compatibility with Win 2000/3/XP/Vista/Win7/8/10/Mac OS World of Warship License – Ant Esports KM500W Combo comes with license World of Warship game. Keyboard Mouse Combo-Ergonomic keyboard and mouse design, fits naturally in your hand. The USB keyboard and gaming mouse is simple to use, just \"plug and play\". 7 Programmable Button : 7 programmable button allows you to design your own mouse.",
      "reviews": [],
      "createdAt": "2025-01-26T12:45:54.228Z",
      "updatedAt": "2025-01-26T12:46:24.785Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 3699,
      "countInStock": 13,
      "_id": "67962ed461e9dd53046b2c84",
      "name": "Razer BlackShark V2 X - White",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/71mwmGYZGzL._SX522_.jpg",
      "brand": "Razer",
      "category": "Electronics",
      "description": "Immersive, 7.1 Surround Sound for Positional Audio: Outfitted with custom-tuned 50 mm drivers, capable of software-enabled surround sound (only available on Windows 10 64-bit) Triforce Titanium 50mm High-End Sound Drivers: Outfitted with cutting-edge, 50mm drivers divided into 3 parts for individual tuning of highs, mids, and lows Lightweight Design with Memory Foam Ear Cushions: Oval, cooling gel-infused cushions that prevent overheating and pressure build-up Noise Isolating Microphone: An improved cardioid mic reduces background and ambient noises for crystal-clear communication COMPATIBILITY : PC, Mac, PS4, Xbox One, Nintendo Switch and mobile devices* (*Mobile devices with an available 3.5mm port)",
      "reviews": [],
      "createdAt": "2025-01-26T12:47:16.013Z",
      "updatedAt": "2025-01-26T12:47:48.501Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 61488,
      "countInStock": 45,
      "_id": "67962f4e61e9dd53046b2c85",
      "name": "Sony Alpha ILCE-6100L APS-C Camera (16-50mm Lens) ",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/61V2JIDmoJL._SX679_.jpg",
      "brand": "Sony",
      "category": "Electronics",
      "description": "Real time eye AF for still + Animal Eye AF Real time tracking World fastest 0.02 Sec AF speed with 425 phase detection and contrast points 24.2MP, EXMOR CMOS sensor with outstanding light sensitivity 11 FPS continuous shooting with AF/AE",
      "reviews": [],
      "createdAt": "2025-01-26T12:49:18.239Z",
      "updatedAt": "2025-01-26T12:49:48.280Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 39999,
      "countInStock": 34,
      "_id": "67962f9461e9dd53046b2c86",
      "name": "Apple iPad (10th Generation): with A14 Bionic chip",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/61uA2UVnYWL._SX522_.jpg",
      "brand": "Apple",
      "category": "Electronics",
      "description": "WHY IPAD — Colourfully reimagined and more versatile than ever, iPad is great for the things you do every day. With an all-screen design, 27.69 cm (10.9″) Liquid Retina display, powerful A14 Bionic chip, superfast Wi-Fi and four gorgeous colours, iPad delivers a powerful way to create, stay connected and get things done. iPadOS + APPS — iPadOS makes iPad more productive, intuitive and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos. iPad comes with essential apps like Safari, Messages and Keynote, with over a million more apps available on the App Store. FAST WI-FI CONNECTIVITY — Wi-Fi 6 gives you fast access to your files, uploads and downloads, and lets you seamlessly stream your favourite shows. PERFORMANCE AND STORAGE — The A14 Bionic chip delivers power and performance for any activity. And with all-day battery life, iPad is perfect for playing immersive games and editing photos and videos. Choose from 64GB or 256GB storage options. APPLE PENCIL AND MAGIC KEYBOARD FOLIO — With Apple Pencil (1st generation), iPad transforms into an immersive drawing canvas and the world’s best note‑taking device. The Magic Keyboard Folio features a versatile two-piece design with a detachable keyboard and a protective back panel that both attach magnetically to iPad. (Accessories are sold separately.)",
      "reviews": [],
      "createdAt": "2025-01-26T12:50:28.938Z",
      "updatedAt": "2025-01-26T12:50:57.258Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 1699,
      "countInStock": 45,
      "_id": "6796311161e9dd53046b2c87",
      "name": "boAt Stone 352 Bluetooth Speaker with 10W RMS Stereo Sound",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/81GnlIB9mFL._SX522_.jpg",
      "brand": "boAt",
      "category": "Electronics",
      "description": "Power- Get ready to be enthralled by the 10W RMS stereo sound on Stone 352 portable wireless speakers. IP Rating- With a speaker that offers an IPX7 marked resistance against water and splashes, you can enjoy your playlists across terrains in a carefree way. Charging Time About 1.5-2 hours Playback- The speaker offers up to a total of 12 hours of playtime per single charge at 60% volume level. Bluetooth Range - 10m True Wireless- It supports TWS functionality, meaning you can connect two Stone 352s together and simultaneously play music on both of them for twice the impact. Modes- You can enjoy your playlists via multiple connectivity modes namely Bluetooth, AUX and TF Card. Controls- You can control playback and adjust volume levels with ease courtesy easy to access controls.",
      "reviews": [],
      "createdAt": "2025-01-26T12:56:49.877Z",
      "updatedAt": "2025-01-26T12:57:31.034Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 34990,
      "countInStock": 24,
      "_id": "6796316061e9dd53046b2c88",
      "name": "GoPro Hero12 Bundle Pack - Includes Hero12 Action Camera",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/51UVLGMN39L._SX679_.jpg",
      "brand": "GoPro",
      "category": "Electronics",
      "description": "1 year International + Free 1* year extended India warranty. *To avail free 1 year local India warranty please register on website (gopro luxurypersonified) What’s Included: HERO12 Black Camera, 2 Enduro Batteries, The Handler (Floating Hand Grip), Head Strap 2.0, Curved Adhesive Mount, Mounting Buckle + Thumb Screw, USB-C Cable, Carrying Case. Extra-Large Field of View : HERO12 Black’s powerful image sensor delivers the most expansive field of view ever on a HERO camera out of the box. It features extra-large 8:7 aspect ratio footage that gets more of the sky and horizon in each shot giving you a huge canvas for your creativity. Simply use the GoPro Quik app to zoom in, crop and edit your shots. 360° Horizon Lock : Give your videos the look of professional productions by keeping the horizon steady, straight and smooth. HERO12 Black’s Linear + Horizon Lock digital lens keeps your footage steady even if your camera rotates a full 360° during capture. 4 Combined with HyperSmooth, Horizon Lock gives you super smooth footage that looks perfectly straight when you want it to. You won’t need a gimbal or stabilization software for pro-quality results. Easy or Pro Controls : HERO12 Black features two control options that let you choose from point-and-shoot simplicity or full camera control. With easy controls, just frame your shot and hit the Shutter button for amazing results. Easily switch between widescreen or mobile shots, capturing slo-mo footage, night effects and making other adjustments in just a few taps. The pro controls unlock the ability to fine-tune all modes, settings and features. Once you’ve dialed in the settings, you can save them as a preset. You can build a whole library of presets for cinematic shots, action footage, night capture or anything else you need.",
      "reviews": [],
      "createdAt": "2025-01-26T12:58:08.766Z",
      "updatedAt": "2025-01-26T12:58:40.943Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 129999,
      "countInStock": 45,
      "_id": "679631b461e9dd53046b2c89",
      "name": "Samsung Galaxy S25 Ultra 5G (Titanium Silverblue, 12GB RAM, 512GB Storage)",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/61sU8OqBs4L._SX679_.jpg",
      "brand": "Samsung",
      "category": "Electronics",
      "description": "Meet Galaxy S25 Ultra, your true AI companion. Powered by the next chapter of Galaxy AI with multi-modality, and the most advanced Galaxy fundamentals, Galaxy S25 Ultra naturally adapts to you: learning your patterns, anticipating your needs, and connecting your world seamlessly. With Now Brief, it also offers you personalized insights to get you through your day. Need to do multiple tasks? Galaxy S25 Ultra performs seamless actions across apps and will get them done for you instantly. Live to create? Galaxy S25 Ultra’s cutting-edge camera and visual creation tools offer you the best camera and editing experience, thanks to its most advanced AI ProVisual Engine. Go from Wide to Tele and even Ultra Wide and get the sharpest details. Love gaming? Enjoy hyper-realistic, ultra-smooth gameplay with the most powerful processor, customized for Galaxy - Snapdragon 8 Elite. All this shielded in an Ultra-strong titanium frame with Galaxy’s toughest glass ever, Corning Gorilla Armor 2.",
      "reviews": [],
      "createdAt": "2025-01-26T12:59:32.767Z",
      "updatedAt": "2025-01-26T13:00:03.568Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 78500,
      "countInStock": 20,
      "_id": "6796321661e9dd53046b2c8a",
      "name": "ZOTAC Gaming GeForce RTX 4070 Ti Super AMP Holo 16 GB GDDR6X Graphics Card",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/61zTcXdk5uL._SX522_.jpg",
      "brand": "ZOTAC",
      "category": "Electronics",
      "description": "Powered by NVIDIA DLSS 3.5: NVIDIA DLSS 3 is an advanced AI-powered technology that greatly improves performance. Using the new gen Tensor Cores and Optical Flow Accelerator on GeForce RTX 4070 Super AMP HOLO 16 GB GPU, DLSS 3.5 creates extra high-quality frames with AI. Ultra-Efficient Ada Lovelace Architecture: The NVIDIA Ultra-Efficient Ada Lovelace architecture is built to deliver Ultra-amazing performance for professional graphics, video, AI, and computing tasks. IceStorm 2.0 Advanced Cooling: With a slimmer profile, it improves thermal regulation by using multiple heat pipes of varying sizes to extract heat from the core efficiently, while the wide aluminum fins help disperse the heat effectively. SPECTRA 2.0 RGB Lighting: One of the standout features of the ZOTAC GeForce RTX 4070 Super AMP HOLO 16 gb Graphic Card enables beautiful lighted colors and silky smooth lighting transitions. The Spectra 2.0 RGB lighting allows for extensive customization according to your preferences FREEZE Fan Stop, Active Fan Control: The freeze fan stop feature, available on selected graphics cards including ours, ensures quieter, more efficient cooling by halting the fan when the GPU is idle, reducing wear and tear",
      "reviews": [],
      "createdAt": "2025-01-26T13:01:10.545Z",
      "updatedAt": "2025-01-26T13:01:44.676Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 29200,
      "countInStock": 34,
      "_id": "679661aafb054a005fa4a2be",
      "name": "MSI G274QPX 27 Inch 2K WQHD Gaming Monitor - 2560 x 1440 Rapid IPS Panel",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/71c37ZIwKvL._SX522_.jpg",
      "brand": "MSI",
      "category": "Electronics",
      "description": "27” WQHD, 240HZ RAPID IPS - The quad high definition 2560 x 1440 Rapid IPS panel (16:9 aspect ratio) features a high 240 Hz refresh rate (G-SYNC Compatible) for smooth aiming/movement tracking; A very low 1ms GtG response time is ideal for esports events VESA DisplayHDR 400 COLOUR INTENSITY - The G274QPX supports realistic game settings with a broad gamut of 1.07 billion colours (136% sRGB, 98% DCI-P3, and 97% Adobe RGB) THE ULTIMATE GAMING EXPERIENCE - MSI Gaming monitors offer a competitive edge with Night Vision smart black tuner. MSI aesthetics DESIGN & UTILITIES - The monitor frame boasts a narrow bezel and useful gaming style screen OSD that is supported by a 5-way navigator at the monitor rear & 4-way adjustable stand HDMI CEC CONNECTIVITY - PC, Mac, console & laptop interface options include DisplayPort 1.4a (WQHD/240Hz) & HDMI 2.0b CEC ports (WQHD/144Hz); Type-C Port (DP Alt.) with Power Delivery 65W.",
      "reviews": [],
      "createdAt": "2025-01-26T16:24:10.099Z",
      "updatedAt": "2025-01-26T16:25:06.539Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 2590,
      "countInStock": 32,
      "_id": "679661f2fb054a005fa4a2bf",
      "name": "Woscherr 578D 2in1 Tyre Inflator for and Car Vacuum Cleaner",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/71fYB6TFSuL._SX679_.jpg",
      "brand": "Woscherr",
      "category": "Electronics",
      "description": "QUICK & POWERFUL FUNCTION: This 2 in 1 car air pump tyre inflator and vacuum cleaner is easy to use and offers faster operation speed with the HEPA filter. It inflates tyres quickly from 0-35 psi in 6 minutes with a maximum pressure of 150 PSI. It is built-in with a 120 Watts cyclonic powerful motor, and 5500PA suction power. CUSTOMER SUPPORT: For any pre or post-purchase queries on car vacuum cleaner, please reach out to Woscher Support Number 77778O8899 from Monday to Saturday, 9:30 AM to 6:30 PM BRIGHT LED LIGHT: The car vacuum cum air pump for car tyre built-in LED light provides illumination in dark environments, making it convenient for inflation and cleaning in low-light conditions. INCLUDES ACCESSORIES: The tyre inflator air pump cum car vacuum cleaner includes a dust brush, crevice nozzle, soft long tube, inflation accessories, a black carry bag, a user manual, and an extended warranty card. WET/DRY FUNCTION: The vacuum cleaner is suitable for both wet and dry messes, making it versatile for different cleaning needs",
      "reviews": [],
      "createdAt": "2025-01-26T16:25:22.908Z",
      "updatedAt": "2025-01-26T16:26:31.099Z",
      "__v": 0
    },
    {
      "rating": 0,
      "numReviews": 0,
      "price": 44990,
      "countInStock": 5,
      "_id": "6796628afb054a005fa4a2c0",
      "name": "Sony PlayStation®5 Digital Edition (slim)",
      "user": "679626ba02e8be260471b934",
      "image": "https://m.media-amazon.com/images/I/51afJC92cgL._SX522_.jpg",
      "brand": "Sony",
      "category": "Electronics",
      "description": "Slim Design: With PS5, players get powerful gaming technology packed inside a sleek and compact console design. 1TB of Storage: Keep your favorite games ready and waiting for you to jump in and play with 1TB of SSD storage built in. Ultra-High Speed SSD: Maximize your play sessions with near instant load times for installed PS5 games. Integrated I/O: The custom integration of the PS5 console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. Ray Tracing: Immerse yourself in worlds with a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5 games. 4K-TV Gaming: Play your favorite PS5 games on your stunning 4K TV. Up to 120fps with 120Hz output: Enjoy smooth and fluid high frame rate gameplay at up to 120fps for compatible games, with support for 120Hz output on 4K displays. HDR Technology: With an HDR TV, supported PS5 games display an unbelievably vibrant and lifelike range of colors. Tempest 3D AudioTech: Immerse yourself in soundscapes where it feels as if the sound comes from every direction. Your surroundings truly come alive with Tempest 3D AudioTech in supported games. Haptic Feedback: Experience haptic feedback via the DualSense wireless controller in select PS5 titles and feel the effects and impact of your in-game actions through dynamic sensory feedback. Adaptive Triggers: Get to grips with immersive adaptive triggers, featuring dynamic resistance levels which simulate the physical impact of in-game activities in select PS5 games. Includes ASTRO’S: Playroom Explore four worlds, each one showcasing innovative gameplay using the versatile features of the DualSense wireless controller, in this game included for all PS5 console users.",
      "reviews": [],
      "createdAt": "2025-01-26T16:27:54.683Z",
      "updatedAt": "2025-01-26T16:28:26.886Z",
      "__v": 0
    }
  ]
